# Books (Core)
Made database via python

In [29]:
import pandas as pd
from sqlalchemy import create_engine
from sqlalchemy_utils import database_exists, create_database
import pymysql
pymysql.install_as_MySQLdb()
from urllib.parse import quote_plus as urlquote
from pandas.io import sql

In [30]:
username = "root"
password = "root" # (whatever password you chose during mysql installation)
db_name = "sakila"
connection = f"mysql+pymysql://{username}:{password}@localhost/books"

In [31]:
engine = create_engine(connection)

In [32]:
engine

Engine(mysql+pymysql://root:***@localhost/books)

In [33]:
df1 = pd.read_csv('data\Books.csv')
df1.head()

   id                 title  author_id
0   1           The Shining          1
1   2                    It          1
2   3      The Great Gatsby          2
3   4  The Call of the Wild          3
4   5   Pride and Prejudice          4

In [34]:
df2 = pd.read_csv('data\Favorites.csv')
df2.head()

   user_id  book_id
0        1        1
1        1        2
2        1        3
3        2        4
4        2        5

In [35]:
df3 = pd.read_csv(r'data\Users.csv')
df3.head()

   id first_name  last_name                 email
0   1       John        Doe          JD@books.com
1   2      Robin      Smith       Robin@books.com
2   3     Gloria  Rodriguez  grodriquez@books.com

In [36]:
df4 = pd.read_csv('data\Authors.csv')
df4.head()

   id        author_name
0   1       Stephen King
1   2  F.Scott Fitgerald
2   3        Jack London
3   4        Jane Austen
4   5       Mary Shelley

In [37]:
df1.to_sql('books', engine, if_exists = 'replace')

6

In [38]:
df2.to_sql('favorites', engine, if_exists = 'replace')

7

In [40]:
df3.to_sql('users', engine, if_exists = 'replace')

3

In [41]:
df4.to_sql('authors', engine, if_exists = 'replace')

5

In [42]:
q = '''SHOW TABLES'''
pd.read_sql(q, engine)

  Tables_in_books
0         authors
1           books
2       favorites
3           users

In [44]:
q = '''SELECT 
    books.title
FROM favorites
JOIN books ON favorites.book_id = books.id
WHERE favorites.user_id = (SELECT users.id FROM books.users
WHERE users.first_name = 'John' AND users.last_name = 'Doe'
);'''

pd.read_sql(q, engine)

              title
0       The Shining
1                It
2  The Great Gatsby